In [1]:
import pandas as pd

DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장

In [2]:
exam_data = {
    'math' : [94, 38, 93],
    'english' : [84, 93, 40],
    'music' : [29, 94, 100],
    'exercise':[39, 50, 94]
}

df = pd.DataFrame(exam_data, index=['Jhon', 'Harry', 'Minu'])
print(df)

       math  english  music  exercise
Jhon     94       84     29        39
Harry    38       93     94        50
Minu     93       40    100        94

데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row) 삭제

In [3]:
df2 = df[:]
df2.drop('Harry', inplace=True)
print(df2)

      math  english  music  exercise
Jhon    94       84     29        39
Minu    93       40    100        94

C:\Users\korea\AppData\Local\Temp\ipykernel_13564\3129288205.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('Harry', inplace=True)

데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2 개 행(row) 삭제

In [4]:
df3 = df[:]
df3.drop(['Harry', 'Minu'], axis=0, inplace=True)
print(df3)

      math  english  music  exercise
Jhon    94       84     29        39

C:\Users\korea\AppData\Local\Temp\ipykernel_13564\1155694839.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['Harry', 'Minu'], axis=0, inplace=True)

데이터프레임 df를 복제하여 변수 df4에 저장. df4의 1개 열(column) 삭제

In [5]:
df4 = df.copy()
df4.drop('math', axis=1, inplace= True)
print(df4)

       english  music  exercise
Jhon        84     29        39
Harry       93     94        50
Minu        40    100        94

데이처프레임 df를 복제하여 변수 df5에 저장. df5의 2개 열(column) 삭제

In [6]:
df5 = df.copy()
df5.drop(['english', 'music'], axis=1, inplace=True)
print(df5)

       math  exercise
Jhon     94        39
Harry    38        50
Minu     93        94

In [7]:
exam_data2 = pd.DataFrame({
    'A': [1, 2, 1, 2],
    'B': '2010-07-20',
    'C': 1.0,
    'D': ['test', 'train', 'test', 'train'],
    'E': 'foo'
})

print(exam_data2)

exam_data2.drop(3, axis=0, inplace=True)
exam_data2.rename(columns={'A':'Type', 'B':'Data'}, inplace=True)
exam_data2.rename(index = {0:'A', 1:'B'}, inplace=True)
exam_data2

   A           B    C      D    E
0  1  2010-07-20  1.0   test  foo
1  2  2010-07-20  1.0  train  foo
2  1  2010-07-20  1.0   test  foo
3  2  2010-07-20  1.0  train  foo

   Type        Data    C      D    E
A     1  2010-07-20  1.0   test  foo
B     2  2010-07-20  1.0  train  foo
2     1  2010-07-20  1.0   test  foo

In [8]:
df

       math  english  music  exercise
Jhon     94       84     29        39
Harry    38       93     94        50
Minu     93       40    100        94

In [9]:
df['Jhon':'Harry']

       math  english  music  exercise
Jhon     94       84     29        39
Harry    38       93     94        50

In [10]:
df['math']

Jhon     94
Harry    38
Minu     93
Name: math, dtype: int64

In [11]:
print(df.loc['Jhon'])

math        94
english     84
music       29
exercise    39
Name: Jhon, dtype: int64

In [12]:
print(df.iloc[1:3])

       math  english  music  exercise
Harry    38       93     94        50
Minu     93       40    100        94

In [13]:
print(df.loc[:, 'math'])

Jhon     94
Harry    38
Minu     93
Name: math, dtype: int64

In [14]:
print(df.loc['Jhon':'Harry', 'math':'music'])
print()
print(df.iloc[0:2, 1:])

       math  english  music
Jhon     94       84     29
Harry    38       93     94

       english  music  exercise
Jhon        84     29        39
Harry       93     94        50

## loc : str
## iloc : int

In [15]:
print(df)

       math  english  music  exercise
Jhon     94       84     29        39
Harry    38       93     94        50
Minu     93       40    100        94

In [16]:
print(df.set_index('math'))

      english  music  exercise
math
94         84     29        39
38         93     94        50
93         40    100        94

# exam

In [17]:
df_loc = pd.DataFrame([["고기", 4, "사자", "yes", "no"],
                      ["풀", 4, "사슴", "yes", "no"],
                      ["고기", 4, "늑대", "yes", "no"],
                      ["고기", 2, "독수리", "yes", "yes"],
                      ["잡식", 2, "곰", "no", "yes"]],
                     columns =  ["주식", "다리갯수", "이름", "무리생활", "비행"])
df_loc

   주식  다리갯수   이름 무리생활   비행
0  고기     4   사자  yes   no
1   풀     4   사슴  yes   no
2  고기     4   늑대  yes   no
3  고기     2  독수리  yes  yes
4  잡식     2    곰   no  yes

In [18]:
print(df_loc.loc[0:3, :])

   주식  다리갯수   이름 무리생활   비행
0  고기     4   사자  yes   no
1   풀     4   사슴  yes   no
2  고기     4   늑대  yes   no
3  고기     2  독수리  yes  yes

In [19]:
print(df_loc.loc[:, ['주식', '이름', '비행']])

   주식   이름   비행
0  고기   사자   no
1   풀   사슴   no
2  고기   늑대   no
3  고기  독수리  yes
4  잡식    곰  yes

In [20]:
print(df_loc.loc[[0, 2, 3],['주식', '이름', '무리생활']])

   주식   이름 무리생활
0  고기   사자  yes
2  고기   늑대  yes
3  고기  독수리  yes

Insert, delete

In [21]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [22]:
df['국어'] = [45, 36, 75]
df['물리'] = 100
df

   이름  수학  영어   음악   체육  국어   물리
0  서준  90  98   85  100  45  100
1  우현  80  89   95   90  36  100
2  인아  70  95  100   90  75  100

In [23]:
df.loc[3] = ['미누', 34, 45, 36, 85, 35, 86]

df

   이름  수학  영어   음악   체육  국어   물리
0  서준  90  98   85  100  45  100
1  우현  80  89   95   90  36  100
2  인아  70  95  100   90  75  100
3  미누  34  45   36   85  35   86

In [24]:
df.set_index('이름', inplace=True)
print(df)

    수학  영어   음악   체육  국어   물리
이름
서준  90  98   85  100  45  100
우현  80  89   95   90  36  100
인아  70  95  100   90  75  100
미누  34  45   36   85  35   86

In [25]:
df.loc['서준', '체육'] = 46
df

    수학  영어   음악  체육  국어   물리
이름
서준  90  98   85  46  45  100
우현  80  89   95  90  36  100
인아  70  95  100  90  75  100
미누  34  45   36  85  35   86

In [26]:
df.iloc[2, 1] = 46
df

    수학  영어   음악  체육  국어   물리
이름
서준  90  98   85  46  45  100
우현  80  89   95  90  36  100
인아  70  46  100  90  75  100
미누  34  45   36  85  35   86

In [27]:
df.loc['서준', ['음악', '체육']] = 36, 56

df

    수학  영어   음악  체육  국어   물리
이름
서준  90  98   36  56  45  100
우현  80  89   95  90  36  100
인아  70  46  100  90  75  100
미누  34  45   36  85  35   86

In [28]:
df.T

이름   서준   우현   인아  미누
수학   90   80   70  34
영어   98   89   46  45
음악   36   95  100  36
체육   56   90   90  85
국어   45   36   75  35
물리  100  100  100  86

In [29]:
dict_data = {
    'c0' : [1, 2, 3],
    'c1' : [4, 5, 6],
    'c2' : [7, 8, 9],
    'c3' : [10, 11, 12],
    'c4' : [13, 14, 15]
}

df = pd.DataFrame(dict_data,
                  index= ['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [30]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']

df2 = df.reindex(new_index, fill_value=0)
df2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

reset_index() : 값을 원래대로 돌아감

In [31]:
df3 = df.reset_index()
df3

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

정렬

In [32]:
df4 = df.sort_index(ascending=False)
df4

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [33]:
df5 = df.sort_values(by='c4', ascending=False)
df5

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

사칙연산, Broadcasting

In [34]:
student1 = pd.Series({'국어':100, 'english':45, 'math':90})

print(student1)

student1_per = (student1*100)/200
print()
print(student1_per)

국어         100
english     45
math        90
dtype: int64

국어         50.0
english    22.5
math       45.0
dtype: float64

In [35]:
student1_pre = pd.Series({'korean': 100, 'english':69, 'math':60})
student1_post = pd.Series({'math':80, 'korean':90, 'english':80})

addition = student1_pre + student1_post
subtraction = student1_pre - student1_post
multi = student1_pre * student1_post
division = student1_pre/student1_post

result = pd.DataFrame([addition, subtraction, multi, division],
                      index = ['add', 'sub', 'mul', 'div'])
result

       english       korean     math
add   149.0000   190.000000   140.00
sub   -11.0000    10.000000   -20.00
mul  5520.0000  9000.000000  4800.00
div     0.8625     1.111111     0.75

In [36]:
! pip install seaborn

Requirement already satisfied: seaborn in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (0.12.2)
Requirement already satisfied: numpy!=1.24.0,>=1.17 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from seaborn) (1.24.3)
Requirement already satisfied: pandas>=0.25 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from seaborn) (2.0.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from seaborn) (3.7.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.0.7)
Requirement already satisfied: cycler>=0.10 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.39.3)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.5.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from pandas>=0.25->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\korea\anaconda3\envs\pandas_study\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)

In [37]:
import seaborn as sb

In [38]:
titanic = sb.load_dataset('titanic')
print(type(titanic))

print(titanic.head())
print(titanic.shape)

<class 'pandas.core.frame.DataFrame'>
   survived  pclass     sex   age  sibsp  parch     fare embarked  class
0         0       3    male  22.0      1      0   7.2500        S  Third  \
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
(891, 15)

In [39]:
titanic_pd= pd.DataFrame(titanic)
titanic_pd

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [40]:
df = titanic.loc[:, ['survived', 'age', 'fare']]
df['won'] = df['fare'] * 1000
df

     survived   age     fare      won
0           0  22.0   7.2500   7250.0
1           1  38.0  71.2833  71283.3
2           1  26.0   7.9250   7925.0
3           1  35.0  53.1000  53100.0
4           0  35.0   8.0500   8050.0
..        ...   ...      ...      ...
886         0  27.0  13.0000  13000.0
887         1  19.0  30.0000  30000.0
888         0   NaN  23.4500  23450.0
889         1  26.0  30.0000  30000.0
890         0  32.0   7.7500   7750.0

[891 rows x 4 columns]